In [1]:
import pandas as pd

In [3]:
#reading the file
data=pd.read_csv("admission - admission.csv")

In [4]:
#Shape of data
data.shape

(500, 9)

In [5]:
#finding null values
data.isnull().sum()

Serial No.           0
GRE Score            0
TOEFL Score          0
University Rating    0
SOP                  3
LOR                  3
CGPA                 0
Research             0
Chance of Admit      0
dtype: int64

In [6]:
# finding data type of each column
data.dtypes

Serial No.             int64
GRE Score              int64
TOEFL Score            int64
University Rating      int64
SOP                  float64
LOR                  float64
CGPA                 float64
Research               int64
Chance of Admit      float64
dtype: object

In [7]:
# finding values==0
(data==0).sum()

Serial No.             0
GRE Score              0
TOEFL Score            0
University Rating      0
SOP                    0
LOR                    0
CGPA                   0
Research             220
Chance of Admit        0
dtype: int64

In [8]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Serial No.         500 non-null    int64
 1   GRE Score          500 non-null    int64
 2   TOEFL Score        500 non-null    int64
 3   University Rating  500 non-null    int64
 4   SOP                497 non-null    float64
 5   LOR                497 non-null    float64
 6   CGPA               500 non-null    float64
 7   Research           500 non-null    int64
 8   Chance of Admit    500 non-null    float64
dtypes: float64(4), int64(5)
memory usage: 35.3 KB

In [9]:
data.describe()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
count,500.000000,500.000000,500.000000,500.000000,497.000000,497.000000,500.000000,500.000000,500.00000
mean,250.500000,316.472000,107.192000,3.114000,3.370221,3.484909,8.576440,0.560000,0.72174
std,144.481833,11.295148,6.081868,1.143512,0.992288,0.925269,0.604813,0.496884,0.14114
min,1.000000,290.000000,92.000000,1.000000,1.000000,1.000000,6.800000,0.000000,0.34000
25%,125.750000,308.000000,103.000000,2.000000,2.500000,3.000000,8.127500,0.000000,0.63000
50%,250.500000,317.000000,107.000000,3.000000,3.500000,3.500000,8.560000,1.000000,0.72000
75%,375.250000,325.000000,112.000000,4.000000,4.000000,4.000000,9.040000,1.000000,0.82000
max,500.000000,340.000000,120.000000,5.000000,5.000000,5.000000,9.920000,1.000000,0.97000

In [10]:
#Selecting columns
select_cols=data[['GRE Score','TOEFL Score']]
select_cols.head()

   GRE Score  TOEFL Score
0        337          118
1        324          107
2        316          104
3        322          110
4        314          103

In [11]:
#sorting data
sorted_data=data.sort_values('GRE Score')
sorted_data.head()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
377,378,290,100,1,1.5,2.0,7.56,0,0.47
117,118,290,104,4,2.0,2.5,7.46,0,0.45
168,169,293,97,2,2.0,4.0,7.80,1,0.64
79,80,294,93,1,1.5,2.0,7.36,0,0.46
272,273,294,95,1,1.5,1.5,7.64,0,0.49

In [12]:
#counting unique values
data.nunique()

Serial No.           500
GRE Score             49
TOEFL Score           29
University Rating      5
SOP                    9
LOR                    9
CGPA                 184
Research               2
Chance of Admit       61
dtype: int64

In [13]:
#changing data type of GRE score from int to float
data['GRE Score']=data['GRE Score'].astype(float)
data.dtypes

Serial No.             int64
GRE Score            float64
TOEFL Score            int64
University Rating      int64
SOP                  float64
LOR                  float64
CGPA                 float64
Research               int64
Chance of Admit      float64
dtype: object